[
  {
    "text": " we can talk about your opinions on Molly and how she was treating our project.",
    "speaker": "SPEAKER_00"
  },
  {
    "text": "I think that she tried to say that our project overall was going well, but she did not get at all and even though she was trying to be nice, it was very evident that she was annoyed, but I don't really know why she was annoyed.",
    "speaker": "SPEAKER_01"
  },
  {
    "text": " She was just seemed annoyed at the situation that she felt like she had to come help us because I think she came to the room with the idea that she was going to do us a favor but then was annoyed with what that thing actually looked like.",
    "speaker": "SPEAKER_01"
  },
  {
    "text": "Yeah, she kind of sat down to take your stuff over and then was annoyed that she was taking it over even though there was no responsibility for her to take it over.",
    "speaker": "SPEAKER_00"
  },
  {
    "text": "I also didn't like that she was",
    "speaker": "SPEAKER_01"
  },
  {
    "text": " going back and forth between trying to like do the thing that my computer and then telling you what to do and then probably not doing a great job either because to me it seemed very clear that she came to the room almost like to be transactional like help us out in a nice way but then was annoyed when she went to help us out and was annoyed that it wasn't like an easier problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "text": " Yeah, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "text": "She was also just giving the vibes of like, I'm a better coder than you guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "text": "Yeah, which was really annoying and not really the point of a hack upon it all.",
    "speaker": "SPEAKER_00"
  },
  {
    "text": "Yeah, and she also",
    "speaker": "SPEAKER_01"
  },
  {
    "text": " was like very blunt about that, but then trying to mask it by, like, compliment bombing us and saying, well, I really think you guys did a good job with this and this, even though it doesn't come off very authentic when right before she had just set it up as a piece of shit and not organized.",
    "speaker": "SPEAKER_01"
  },
  {
    "text": "Yeah, I was really annoying.",
    "speaker": "SPEAKER_00"
  }
]